Install package(s):

conda create --name pandas-env python -c conda-forge  
conda activate pandas-env  
conda install pandas -c conda-forge

**read_csv():** This function is used to read comma-separated values (CSV) files into a Pandas DataFrame.  
**head():** This function displays the first few rows of a DataFrame.  
**tail():** This function displays the last few rows of a DataFrame.  
**info():** This function provides information about a DataFrame, such as its dimensions, data types, and memory usage.  
**dtypes():** This function returns the data types of each column in a DataFrame.  
**describe():** This function provides summary statistics for each numeric column in a DataFrame, such as the mean, median, etc.  
**sort_values():** This function sorts a DataFrame by one or more columns  
**groupby():** This function groups a DataFrame by one or more columns and performs aggregate operations on the groups.  
**iloc():** This function will find a row or column level element in the dataframe    
**drop_duplicates():** This function removes duplicate rows from a DataFrame.

In [27]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [28]:
df = pd.read_csv('sample_data_small.txt')
type(df)

pandas.core.frame.DataFrame

In [29]:
df.head(3)

   Name  Age Sex       Job
0   Joe   24   M  Engineer
1  Mary   26   F  Engineer
2  Jane   32   F  Engineer

In [30]:
df.tail(2)

  Name  Age Sex       Job
7  Joe   27   M  Engineer
8  Joe   27   M  Engineer

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      int64
 2   Sex     9 non-null      object
 3   Job     9 non-null      object
dtypes: int64(1), object(3)
memory usage: 416.0+ bytes

In [32]:
df.dtypes

Name    object
Age      int64
Sex     object
Job     object
dtype: object

In [33]:
df.describe()

             Age
count   9.000000
mean   27.444444
std     2.603417
min    24.000000
25%    26.000000
50%    27.000000
75%    28.000000
max    32.000000

In [34]:
df.sort_values(by=['Age'])

    Name  Age Sex         Job
0    Joe   24   M    Engineer
4  Nancy   25   F  Technician
1   Mary   26   F    Engineer
6  Sally   27   F     Manager
7    Joe   27   M    Engineer
8    Joe   27   M    Engineer
5  Harry   28   M     Manager
3   Jane   31   F    Engineer
2   Jane   32   F    Engineer

In [35]:
# Single groupby
df.groupby(['Sex','Job']).agg({'Age': ['sum'], 'Name': pd.Series.mode})

               Age   Name
               sum   mode
Sex Job
F   Engineer    89   Jane
    Manager     27  Sally
    Technician  25  Nancy
M   Engineer    78    Joe
    Manager     28  Harry

In [36]:
df.iloc[0]

Name         Joe
Age           24
Sex            M
Job     Engineer
Name: 0, dtype: object

In [37]:
df.iloc[0][0]

'Joe'

In [38]:
df.drop_duplicates()

    Name  Age Sex         Job
0    Joe   24   M    Engineer
1   Mary   26   F    Engineer
2   Jane   32   F    Engineer
3   Jane   31   F    Engineer
4  Nancy   25   F  Technician
5  Harry   28   M     Manager
6  Sally   27   F     Manager
7    Joe   27   M    Engineer